Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: БЭМ больше схож с Web Components, чем с перечисленными решениями для CSS. (В чем разница между БЭМ и Web Components?)
en: BEM has more in common with Web Components than with the CSS solutions listed. (What is the difference between BEM and Web Components?)

source: БЭМ предоставляет комплексное решение по созданию архитектуры проекта и помогает организовать процессы разработки. Подробнее читайте в разделе Применение методологии для решения задач веб-разработки.
en: BEM provides a comprehensive solution for creating the architecture for your project and helps organize development processes. For details, see the section Using the methodology for solving web development problems.

source: https://ru.bem.info/method/
en: https://en.bem.info/method/

source: Подробнее о методологии БЭМ.
en: Find out more about the BEM methodology.

source: Можно использовать БЭМ только на уровне CSS. Для этого достаточно просто следовать рекомендациям методологии.
en: It is possible to use BEM at the CSS level only. You just need to follow the guidelines proposed by the methodology.

source: Поддержка браузеров
en: Browser support

source: Web Components не поддерживается в Safari, iOS Safari, Internet Explorer, Firefox.
en: Web Components are not supported by Safari, iOS Safari, Internet Explorer, Firefox.

source: БЭМ работает во всех браузерах.
en: BEM works in all browsers.

source: Инкапсуляция
en: Encapsulation

source: В Web Components реализована через Shadow DOM.
en: Web Components use Shadow DOM.

source: В БЭМ — с помощью элементов блока.
en: BEM uses block elements.

source: Работа шаблонов
en: Template execution

source: В Web Components шаблоны всегда выполняются в браузере. Это может потребовать дополнительных решений проблем с индексацией.
en: In Web Components, templates are always executed in the browser. This may involve solving some indexing problems.

source: В БЭМ генерация шаблона возможна на этапе разработки. Это позволяет отдавать готовый HTML. Шаблоны могут выполняться как в браузере, так и на сервере.
en: In BEM, template generation is possible at the development stage. This let us pass the ready HTML. Templates can be executed both in the browser and on the server side.

source: Web Components использует императивный принцип — интерполяцию строк.
en: Web Components are based on an imperative principle, using string interpolation.

source: https://ru.bem.info/authors/berezhnoy-sergey/
en: https://en.bem.info/authors/berezhnoy-sergey/

source: БЭМ использует декларативный подход, который позволяет гибко управлять шаблонизацией и избегать повторений. Подробно о разнице между декларативным и императивным подходами смотрите в докладе Сергея Бережного — Шаблонизаторы.
en: BEM uses a declarative approach, which helps manage templating in a flexible way and avoid redundancy. For a detailed explanation about the difference between a declarative and imperative approaches, watch Sergey Berezhnoy's Templating engines talk.

source: Вместо импорта HTML — сборка
en: Build vs HTML import

source: Web Components использует импорт HTML (HTML Imports), который работает непосредственно в браузере. Для объединения HTML-файлов используется инструмент Vulcanize.
en: Web Components use HTML Imports, which work directly in the browser. The Vulcanize tool is used to aggregate multiple HTML files into one file.

source: https://ru.bem.info/tools/bem/enb-bem/
en: https://en.bem.info/tools/bem/enb-bem/

source: https://ru.bem.info/tools/bem/bem-tools/
en: https://en.bem.info/tools/bem/bem-tools/

source: БЭМ использует сборщики: ENB или bem-tools.
en: BEM uses build tools: ENB or bem-tools.

source: Вместо Custom Elements — абстракция над DOM-деревом
en: Abstraction over a DOM tree vs Custom Elements

source: В Web Components используются Custom Elements. Такой подход позволяет разместить на одном DOM-узел только один компонент.
en: In Web Components, Custom Elements are used. Such an approach allows only for one component to be hosted on a single DOM node.

source: В БЭМ существует понятие БЭМ-дерева. БЭМ использует миксы — размещение нескольких БЭМ-сущностей на одном DOM-узле.
en: BEM introduces the concept of a BEM tree. BEM uses mixes — the practice of hosting several BEM entities on a single DOM node.

source: В терминах БЭМ Bootstrap — это набор сверстанных блоков. БЭМ — не библиотека элементов интерфейса, а методология, позволяющая:
en: In BEM terms, Bootstrap is a set of ready-made blocks. BEM, on the other hand, is not a library of interface elements but a methodology that allows you to

source: создавать архитектуру проекта;
en: Create the architecture for your project

source: разрабатывать веб-приложения независимыми блоками;
en: Develop web applications based on independent blocks

source: упрощать поддержку проектов.
en: Facilitate project support.

source: https://ru.bem.info/libs/bem-components/
en: https://en.bem.info/libs/bem-components/

source: https://ru.bem.info/libs/
en: https://en.bem.info/libs/

source: Библиотека блоков, сделанных на БЭМ — bem-components. Существуют также и другие БЭМ-библиотеки.
en: BEM does provide its own block library, called bem-components. Other BEM libraries are also available.

source: В каком случае создавать блок, в каком элемент?
en: A block or an element: when should I use which?

source: Если фрагмент кода может использоваться повторно и не зависит от реализации других компонентов страницы, необходимо создавать блок.
en: If you're dealing with a fragment of code that can be reused and does not depend on the implementation of other components of the page, you should implement it as a block.

source: Если фрагмент кода не может использоваться самостоятельно, без родительской сущности (блока), в большинстве случаев создается элемент.
en: If it's a fragment of code that cannot be used on its own, without a parent entity (block), in most cases that should be an element.

source: Исключение составляют элементы, реализация которых для упрощения разработки требует разделения на более мелкие части — подэлементы. БЭМ-методология не рекомендует создавать элементы элементов. В подобном случае вместо элемента необходимо создавать служебный блок.
en: This rule does not apply when implementing elements that, for reasons of simplifying the development process, have to be broken down into smaller, sub-element, parts. The BEM methodology does not recommend creating elements of elements. So, in cases like this, instead of an element, a service block should be created.

source: Наличие элементов элементов ограничивает возможность изменять внутреннюю структуру блока: элементы нельзя поменять местами, удалить или добавить без корректировки существующего кода.
en: The existence of elements of elements hinders the ability to change the internal structure of the block: elements cannot be swapped around, removed or added without modifying the existing code.

source: В методологии БЭМ вложенную структуру поддерживают только блоки (block__elem). Имя блока задает пространство имен, которое гарантирует зависимость элементов от блока.
en: In the BEM methodology, blocks are the only entities that support nested structure (block_elem). A block name defines a namespace that ensures the dependence of elements on the block.

source: Блок может иметь вложенную структуру элементов в DOM-дереве:
en: A block can have a nested element structure in a DOM tree.

source: Однако эта же структура блока в методологии БЭМ всегда будет представлена плоским списком элементов:
en: In the BEM methodology, though, the same structure is always represented by a flat list of elements.

source: Это позволяет изменять DOM-структуру блока без внесения правок в коде каждого отдельного элемента:
en: This makes it possible to change the DOM structure of the block without modifying the code of each individual element.

source: Структура блока меняется, а правила для элементов и их названия остаются прежними.
en: The structure of the block changes while the rules for its elements and their names remain the same.

source: Имя блока в именах БЭМ-сущностей обеспечивает:
en: A block name in the names of BEM entities is used for

source: Пространство имен
en: Namespace

source: Миксы
en: Mixes

source: Поиск в коде
en: Code searching

source: Важно! Методология БЭМ допускает выбор удобной стратегии именования, но требует соблюдения консистентности в названиях. Так, например, все варианты верны: context, ctx или c, attributes, attrs или as. Необходимо выбрать один из них и использовать во всем проекте. _____________________________________________
en: NB: The BEM methodology allows freedom of choice when it comes to a choosing a preferred naming strategy, however consistency of names is required. For example, the following are all valid options: context, ctx or c, attributes, attrs or as. Select one name and stick with it throughout the project. _____________________________________________

source: Имя блока задает пространство имен и обеспечивает уникальность имен элементов и модификаторов. Это позволяет ограничить влияние элементов и модификаторов одного блока на реализацию другого.
en: A block name defines a namespace and ensures unique names for elements and modifiers. This helps reduce the impact of elements and modifiers of one block on the implementation of another.

source: Микс — это совмещение разных БЭМ-сущностей на одном DOM-узле. При миксе модификатора имя блока указывает, к какому блоку применится модификатор. Если имя блока не указать, модификатор применится ко всем миксуемым БЭМ-сущностям.
en: A mix is an instance of different BEM entities being hosted on a single DOM node. When mixing a modifier, a block name indicates what block the modifier will be applied to. If a block name is not specified, the modifier will be applied to all the mixed BEM entities.

source: Например, рассмотрим микс пункта меню (menu__item) и кнопки (button):
en: Let's say we have a mix of an menu item (menu_item) and a button (button:

source: Добавим модификатор active в сокращенной форме записи (без имени блока):
en: Let's add a modifier called active in short notation (with no block name):

source: В таком виде HTML-разметка не дает понять, к чему относится модификатор: к пункту меню (menu__item.active) или к кнопке (button.active). Имя блока (button_active) явно указывает на БЭМ-сущность, к которой будет применен модификатор.
en: This kind of HTML markup leaves it unclear as to whether the modifier relates to the menu item (menu_item.active) or the button (button.active). Specifying the block name (button_active) indicates the BEM entity to which the modifier will be applied.

source: Также запись <div class="block mod"> не дает понять, какие БЭМ-сущности используются в работе. Например, из записи <div class="checkbox button"> нельзя однозначно определить, это микс модификатора и блока или микс двух блоков.
en: Likewise, notation like <div class="block mod"> leaves it unclear as to what BEM entities are being used. For example, you can't tell from <div class="checkbox button"> whether it's a mix of a modifier and a block or a mix of two blocks.

source: Полное имя модификатора <div class="block block_mod"> показывает, о каких сущностях идет речь: <div class="checkbox checkbox_button">.
en: The full name of the modifier <div class="block block_mod"> leaves no doubt as to the types of entities: <div class="checkbox checkbox_button">.

source: Явные и уникальные имена облегчают поиск необходимой сущности в коде и файловой системе.
en: Explicit and unique names facilitate searching the code or the file system for specific entities.

source: Сравним результаты глобального поиска при отладке проекта. Найдем модификатор active. В сокращенном виде (active) в результаты поиска попадут все возможные комбинации и HTML-фрагменты, где встречается active. В записи, рекомендуемой методологией, само название уже будет содержать уточняющий параметр в виде имени блока (button_active). Так как имя модификатора уникально, в результаты поиска попадут только нужные фрагменты кода.
en: Let's compare the results of a global search during the debugging stage. Let's find a modifier called active. If short notation is used (active), the search results will include all possible combinations and HTML fragments containing active. In the BEM-recommended notation the name of the modifier already contains a additional search parameter in the form of the block name (button_active). Because the modifier name is unique, the search will return only relevant code fragments.

source: В БЭМ отсутствует понятие глобальных модификаторов, так как модификатор всегда относится к одной конкретной БЭМ-сущности.
en: BEM does not accommodate the concept of global modifiers — any modifier always belongs to one specific BEM entity.

source: Если требуется вынести CSS-свойство за пределы одного блока и применять его к разным БЭМ-сущностям в проекте, необходимо создавать отдельный блок, реализованный в технологии CSS.
en: If a CSS property needs to be moved outside of a block and applied to different BEM entities in the project, a separate block should be created, implemented in the CSS technology.

source: БЭМ позволяет совмещать реализацию разных блоков с помощью миксов:
en: BEM allows us to combine the implementation of different blocks using mixes:

source: Файловая система БЭМ-проекта разделяется на вложенные директории и файлы для удобства разработки и поддержки проекта.
en: For the purpose of convenient development and support, the file system of a BEM project is divided into nested directories and files.

source: Придерживаться рекомендуемой структуры файловой системы не обязательно. Вы можете использовать любую альтернативную структуру проекта, соответствующую принципам организации файловой системы БЭМ, например:
en: The use of the recommended file system structure is optional. You can use any alternative project structure that conforms to the principles of BEM file system organization, for example:

source: flex-схема
en: flex scheme

source: Элементы и модификаторы реализованы в отдельных файлах.
en: Elements and modifiers are implemented in separate files.

source: Блоку соответствует отдельная директория.
en: One block per directory.

source: Элементы и модификаторы реализованы в файлах блока.
en: Elements and modifiers are implemented inside block files.

source: flat-схема
en: flat scheme

source: Директории для блоков не используются.
en: Blocks don't have their own directories.

source: Опциональные элеметы и модификаторы реализованы в отдельных файлах.
en: Optional elements and modifiers are implemented in separate files.

source: https://ru.bem.info/technology/i-bem/
en: https://en.bem.info/technology/i-bem/

source: i-bem.js это специализированный фреймворк для разработки проектов на JavaScript в терминах блоков, элементов и модификаторв.
en: i-bem.js is a specialized framework for developing projects with JavaScript in terms of blocks, elements, and modifiers.

source: i-bem.js не предназначен для замены фреймворка общего назначения, такого как jQuery.
en: -bem.js is not meant to replace any general-purpose framework, such as jQuery.

source: i-bem.js позволяет:
en: i-bem.js allows you to

source: разрабатывать веб-интерфейс в терминах блоков, элементов, модификаторов;
en: Develop a web interface in terms of blocks, elements, modifiers

source: интегрировать JavaScript-код с шаблонами и CSS-правилами в стиле БЭМ;
en: Integrate JavaScript code with templates and BEM-style CSS rules

source: описывать логику работы блока как набор состояний.
en: Describe the logic of a block as a set of states.

source: Ключевая идея БЭМ — независимость блоков. Вложенные селекторы увеличивают связанность кода и делают его повторное использование невозможным. Это противоречит принципам БЭМ.
en: BEM is all about independent blocks. Nested selectors increase interdependency within the code and make code reuse impossible. This is in contradiction to the BEM principles.

source: Методология БЭМ допускает использование таких селекторов, но рекомендует по-максимуму его сократить.
en: The BEM methodology allows nested selectors, but recommends keeping their use to a minimum.

source: Например, вложенность уместна, чтобы менять элементы в зависимости от состояния блока или заданной ему темы:
en: For instance, nesting is appropriate for changing elements depending on the state of a block or its assigned theme.

source: Комбинированные селекторы усложняют переопределение блока, так как имеют более высокую специфичность в CSS, чем одиночные. Специфичность комбинированного селектора для модификатора блока (.block1.mod) и для переопределенного блока (.block2 .block1) одинакова. Переопределение блока будет зависеть только от порядка объявления правил в декларации.
en: Combined selectors make block redefinition more difficult because of their higher CSS specificity compared to single selectors. Combined selectors for a block modifier (.block1.mod) and for a redefined block (.block2 .block1) have the same specificity. Block redefinition would depend only on the order of rules in the declaration.

source: Правила модификатора active для кнопки записываются как комбинированный селектор .button.active. При переопределении кнопки с помощью родительского блока header, создается селектор .header .button. Специфичность обоих селекторов одинакова, значит применение CSS-правил определяется порядком их объявления в декларации.
en: The rules for the modifier active for the button are written as the combined selector .button.active. To redefine the button with the parent block header, selector .header .button is created. Both selectors have the same specificity, so the application of CSS rules is determined by their declaration order.

source: Использование имени блока в названии модификатора обеспечивает более высокий приоритет CSS-правилам при переопределении блока. Селектор .header .button всегда будет иметь приоритет выше, чем .button_active.
en: Using the block name in the name of a modifier gives a higher priority to CSS rules for block redefinition. The .header .button selector will be always of a higher priority than .button_active.

source: Причины использования имени блока в имени модификатора
en: Reasons for including the block name in a modifier name

source: Можно ли объединять тег и класс в селекторе? Например, button.button.
en: Can I combine a tag and a class in a selector (e.g. button.button)?

source: Совмещение тега и класса в селекторе повышает специфичность CSS-правил. При добавлении модификатора правила блока не смогут быть переопределены, так как специфичность селектора блока выше.
en: Combining a tag and a class in one selector increases its CSS specificity. Adding a modifier won't redefine the CSS rules of the block since the specificity of the block selector is higher.

source: Рассмотрим пример:
en: Let's look at an example:

source: Записываем для него CSS-правила в селекторе button.button.
en: Let's use a button.button selector for the CSS rules of this block.

source: Добавим модификатор:
en: Now with a modifier:

source: Cелектор .button_mod не переопределит свойства блока, записанные как button.button, так как специфичность button.button выше. Для успешного переопределения селектор модификатора блока также должен быть скомбинирован с тегом button.button_mod.
en: The .button_mod selector will not redefine CSS properties of the block with the button.button selector, as the latter has higher specificity. For the redefinition to work, the selector for the modifier needs to be combined with the tag as well: button.button_mod.

source: В результате развития проекта могут появится блоки с селекторами input.button, span.button и, например, a.button. В таком случае все модификаторы блока button и вложенные в него элементы потребуют четыре разные декларации для каждого случая.
en: As your project keeps growing, you may have blocks with selectors like input.button, span.button and, say, a.button. Then all modifiers of the button block and all its nested elements will require four different declarations for each instance.

source: Почему в БЭМ не используют пользовательские теги (custom tags) для блоков?
en: Why are custom tags not used for blocks in BEM?

source: Блоки могут выражаться в HTML с помощью пользовательских тегов, к которым создаются CSS-правила. В таком случае классы можно будет использовать только для модификаторов: <button class="mod"/>.
en: Blocks could be represented in HTML by custom tags, with CSS rules defined for them. In that case classes would only be used for modifiers: <button class="mod"/>.

source: Пользовательские теги могут применяться для создания селекторов к блокам, но есть ряд ограничений:
en: Custom tags can indeed be used for creating block selectors, but the following restrictions apply

source: Невозможно использовать миксы.
en: Mixes can't be used.

source: Не любой блок можно выразить пользовательским тегом. Например, для всех ссылок необходим тег <a preserve="1">, а для полей — <input>.
en: Not all blocks can be represented by custom tags. For example, all links require an <a preserve="1"> tag, and all fields require <input>.

source: Блок — независимый компонент. На него не должны влиять CSS-правила, созданные для всей страницы. Это нарушает независимость блоков и затрудняет их повторное использование.
en: Blocks are independent components. They must not be affected by page-wide CSS rules. Otherwise their independence is compromised and their reuse becomes problematic.

source: Общий сброс стилей по сути реализуется с помощью глобальных CSS-правил, которые в большинстве случаев пишутся к селекторам на тег, что нежелательно использовать в БЭМ-проекте.
en: A CSS Reset is carried out using global CSS rules, which are in most cases written for tag selectors, which is not recommended practice for a BEM project.

source: Если сбросить стили все-таки необходимо, в БЭМ это делается в каждом блоке.
en: If you must reset your styles, in BEM you can do it on a per-block basis.

source: Рассмотрим пример. Если в проекте блоки меню и список выражены в HTML с помощью тега <ul>, значит каждый блок должен предоставлять сброс CSS для <ul>. Повторов в результирующем коде можно избежать с помощью CSS-оптимизатора.
en: Here is an example. If a menu block and a list block in your project are both represented by a <ul> tag in HTML, then each block must provide a CSS Reset for <ul>. Duplication in the resultant code can be avoided by using a CSS optimizer.

source: Если в проекте не используется CSS-оптимизатор, который объединяет селекторы с одинаковым набором правил, можно применить CSS-препроцессор. Тогда для каждого нового блока можно делать сброс правил, миксуя чистый код. Например, в SASS это будет выглядеть так:
en: If your project does not use a CSS optimizer that combines selectors with the same sets of rules, you can use a CSS preprocessor. Then you can have a reset of rules for every new block, mixing the proper code. E.g., in SASS it would look like this:

source: Такой способ следует использовать только при отсутствии оптимизатора.
en: This method is only appropriate in the absence of an optimizer.

source: Совмещение нескольких модификаторов на одном и том же блоке (например, <div class="block_theme_christmas block_size_big">) приведет к дублированию кода, реализующего базовую функциональность (логику и стили) блока.
en: Using multiple modifiers on the same block (e.g., <div class="block_theme_christmas block_size_big">) will cause duplication of the code that implements the basic functionality (logic and styles) of the block.
